results/redis_bench.txt
=== Redis Benchmark Results ===
--------------------------------------------------------
Pipeline Depth: 1
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 66%,   1 secs]  2 threads 10 conns:      132453 ops,  132441 (avg:  132441) ops/sec, 9.49MB/sec (avg: 
9.49MB/sec),  0.15 (avg:  0.15) msec latency
[RUN #1 100%,   1 secs]  0 threads 10 conns:      200000 ops,  132441 (avg:  132213) ops/sec, 9.49MB/sec (avg: 
9.47MB/sec),  0.15 (avg:  0.15) msec latency

warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        71618.53          ---          ---         0.15118         0.14300         0.45500         0.76700      5524.83 
Gets         7957.61         0.00      7957.61         0.15100         0.14300         0.47100         0.78300       310.78 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      79576.15         0.00      7957.61         0.15117         0.14300         0.45500         0.76700      5835.61 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.063        5.000
SET       0.071       10.000
SET       0.087       15.000
SET       0.095       20.000
SET       0.103       25.000
SET       0.111       30.000
SET       0.119       35.000
SET       0.127       40.000
SET       0.135       45.000
SET       0.143       50.000
SET       0.143       52.500
SET       0.151       55.000
SET       0.151       57.500
SET       0.151       60.000
SET       0.159       62.500
SET       0.159       65.000
SET       0.167       67.500
SET       0.167       70.000
SET       0.175       72.500
SET       0.183       75.000
SET       0.183       76.250
SET       0.183       77.500
SET       0.191       78.750
SET       0.191       80.000
SET       0.199       81.250
SET       0.199       82.500
SET       0.207       83.750
SET       0.215       85.000
SET       0.215       86.250
SET       0.223       87.500
SET       0.231       88.125
SET       0.231       88.750
SET       0.239       89.375
SET       0.239       90.000
SET       0.247       90.625
SET       0.247       91.250
SET       0.255       91.875
SET       0.263       92.500
SET       0.271       93.125
SET       0.271       93.750
SET       0.279       94.062
SET       0.287       94.375
SET       0.287       94.688
SET       0.295       95.000
SET       0.295       95.312
SET       0.303       95.625
SET       0.311       95.938
SET       0.319       96.250
SET       0.327       96.562
SET       0.335       96.875
SET       0.343       97.031
SET       0.343       97.188
SET       0.351       97.344
SET       0.359       97.500
SET       0.367       97.656
SET       0.375       97.812
SET       0.383       97.969
SET       0.391       98.125
SET       0.399       98.281
SET       0.407       98.438
SET       0.415       98.516
SET       0.423       98.594
SET       0.431       98.672
SET       0.431       98.750
SET       0.439       98.828
SET       0.447       98.906
SET       0.455       98.984
SET       0.463       99.062
SET       0.479       99.141
SET       0.487       99.219
SET       0.495       99.258
SET       0.495       99.297
SET       0.503       99.336
SET       0.511       99.375
SET       0.519       99.414
SET       0.519       99.453
SET       0.535       99.492
SET       0.535       99.531
SET       0.551       99.570
SET       0.559       99.609
SET       0.567       99.629
SET       0.575       99.648
SET       0.583       99.668
SET       0.591       99.688
SET       0.599       99.707
SET       0.607       99.727
SET       0.615       99.746
SET       0.623       99.766
SET       0.639       99.785
SET       0.647       99.805
SET       0.655       99.814
SET       0.663       99.824
SET       0.671       99.834
SET       0.679       99.844
SET       0.695       99.854
SET       0.703       99.863
SET       0.719       99.873
SET       0.743       99.883
SET       0.759       99.893
SET       0.775       99.902
SET       0.783       99.907
SET       0.791       99.912
SET       0.807       99.917
SET       0.815       99.922
SET       0.831       99.927
SET       0.847       99.932
SET       0.863       99.937
SET       0.895       99.941
SET       0.903       99.946
SET       0.927       99.951
SET       0.943       99.954
SET       0.951       99.956
SET       1.007       99.958
SET       1.023       99.961
SET       1.039       99.963
SET       1.055       99.966
SET       1.079       99.968
SET       1.111       99.971
SET       1.135       99.973
SET       1.239       99.976
SET       1.311       99.977
SET       1.311       99.978
SET       1.351       99.979
SET       1.375       99.980
SET       1.391       99.982
SET       1.391       99.983
SET       1.407       99.984
SET       1.431       99.985
SET       1.455       99.987
SET       1.495       99.988
SET       1.503       99.988
SET       1.607       99.989
SET       1.623       99.990
SET       1.647       99.990
SET       1.663       99.991
SET       1.767       99.991
SET       1.775       99.992
SET       1.791       99.993
SET       1.799       99.993
SET       1.799       99.994
SET       1.799       99.994
SET       1.807       99.995
SET       1.807       99.995
SET       1.807       99.995
[...]
SET       1.815       99.996
SET       1.815       99.996
SET       1.815       99.996
SET       1.815       99.997
SET       1.815       99.997
SET       1.815       99.997
SET       1.831       99.997
SET       1.831       99.997
SET       1.831       99.998
SET       1.831       99.998
SET       1.839       99.998
SET       1.839       99.998
SET       1.839       99.998
[...]
SET       1.839       99.999
SET       1.839       99.999
SET       1.839       99.999
[...]
SET       1.847       99.999
SET       1.847       99.999
SET       1.847       99.999
[...]
SET       1.871       99.999
SET       1.871      100.000
---
GET       0.023        0.000
GET       0.063        5.000
GET       0.071       10.000
GET       0.079       15.000
GET       0.095       20.000
GET       0.103       25.000
GET       0.111       30.000
GET       0.119       35.000
GET       0.127       40.000
GET       0.135       45.000
GET       0.143       50.000
GET       0.143       52.500
GET       0.151       55.000
GET       0.151       57.500
GET       0.151       60.000
GET       0.159       62.500
GET       0.159       65.000
GET       0.167       67.500
GET       0.167       70.000
GET       0.175       72.500
GET       0.183       75.000
GET       0.183       76.250
GET       0.183       77.500
GET       0.191       78.750
GET       0.191       80.000
GET       0.199       81.250
GET       0.199       82.500
GET       0.207       83.750
GET       0.215       85.000
GET       0.215       86.250
GET       0.223       87.500
GET       0.231       88.125
GET       0.231       88.750
GET       0.231       89.375
GET       0.239       90.000
GET       0.239       90.625
GET       0.247       91.250
GET       0.255       91.875
GET       0.263       92.500
GET       0.263       93.125
GET       0.271       93.750
GET       0.279       94.062
GET       0.279       94.375
GET       0.287       94.688
GET       0.295       95.000
GET       0.295       95.312
GET       0.303       95.625
GET       0.311       95.938
GET       0.311       96.250
GET       0.327       96.562
GET       0.335       96.875
GET       0.343       97.031
GET       0.343       97.188
GET       0.351       97.344
GET       0.359       97.500
GET       0.367       97.656
GET       0.375       97.812
GET       0.375       97.969
GET       0.391       98.125
GET       0.399       98.281
GET       0.407       98.438
GET       0.415       98.516
GET       0.423       98.594
GET       0.431       98.672
GET       0.439       98.750
GET       0.439       98.828
GET       0.455       98.906
GET       0.463       98.984
GET       0.479       99.062
GET       0.487       99.141
GET       0.495       99.219
GET       0.495       99.258
GET       0.503       99.297
GET       0.511       99.336
GET       0.511       99.375
GET       0.519       99.414
GET       0.535       99.453
GET       0.535       99.492
GET       0.543       99.531
GET       0.559       99.570
GET       0.567       99.609
GET       0.567       99.629
GET       0.575       99.648
GET       0.575       99.668
GET       0.583       99.688
GET       0.591       99.707
GET       0.599       99.727
GET       0.607       99.746
GET       0.615       99.766
GET       0.623       99.785
GET       0.623       99.805
GET       0.631       99.814
GET       0.639       99.824
GET       0.647       99.834
GET       0.671       99.844
GET       0.687       99.854
GET       0.695       99.863
GET       0.695       99.873
GET       0.719       99.883
GET       0.759       99.893
GET       0.823       99.902
GET       0.863       99.907
GET       0.887       99.912
GET       0.895       99.917
GET       0.903       99.922
GET       0.935       99.927
GET       0.999       99.932
GET       0.999       99.937
GET       1.023       99.941
GET       1.023       99.946
GET       1.111       99.951
GET       1.111       99.954
GET       1.263       99.956
GET       1.263       99.958
GET       1.287       99.961
GET       1.287       99.963
GET       1.311       99.966
GET       1.311       99.968
GET       1.335       99.971
GET       1.335       99.973
GET       1.351       99.976
GET       1.351       99.977
GET       1.351       99.978
GET       1.351       99.979
GET       1.367       99.980
GET       1.367       99.982
GET       1.367       99.983
GET       1.367       99.984
GET       1.399       99.985
GET       1.399       99.987
GET       1.399       99.988
GET       1.399       99.988
GET       1.399       99.989
GET       1.399       99.990
GET       1.823       99.990
GET       1.823       99.991
GET       1.823       99.991
GET       1.823       99.992
GET       1.823       99.993
GET       1.823       99.993
GET       1.823       99.994
GET       1.823       99.994
GET       1.823       99.995
GET       1.823       99.995
GET       1.855       99.995
GET       1.855      100.000
---
WAIT      0.000      100.000



--------------------------------------------------------
Pipeline Depth: 10
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   0 secs]  0 threads 10 conns:      200000 ops,       0 (avg:  814946) ops/sec, 0.00KB/sec (avg: 
58.36MB/sec),  0.00 (avg:  0.24) msec latency

2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       739234.89          ---          ---         0.24396         0.23900         0.53500         0.97500     57026.41 
Gets        82137.21         0.00     82137.21         0.24396         0.23900         0.53500         0.97500      3207.84 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     821372.10         0.00     82137.21         0.24396         0.23900         0.53500         0.97500     60234.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.031        0.000
SET       0.143        5.000
SET       0.167       10.000
SET       0.183       15.000
SET       0.191       20.000
SET       0.199       25.000
SET       0.207       30.000
SET       0.215       35.000
SET       0.223       40.000
SET       0.231       45.000
SET       0.239       50.000
SET       0.239       52.500
SET       0.247       55.000
SET       0.247       57.500
SET       0.255       60.000
SET       0.263       62.500
SET       0.263       65.000
SET       0.271       67.500
SET       0.271       70.000
SET       0.279       72.500
SET       0.279       75.000
SET       0.287       76.250
SET       0.287       77.500
SET       0.287       78.750
SET       0.295       80.000
SET       0.295       81.250
SET       0.295       82.500
SET       0.303       83.750
SET       0.303       85.000
SET       0.311       86.250
SET       0.311       87.500
SET       0.319       88.125
SET       0.319       88.750
SET       0.319       89.375
SET       0.327       90.000
SET       0.327       90.625
SET       0.335       91.250
SET       0.335       91.875
SET       0.343       92.500
SET       0.351       93.125
SET       0.359       93.750
SET       0.359       94.062
SET       0.367       94.375
SET       0.375       94.688
SET       0.375       95.000
SET       0.383       95.312
SET       0.391       95.625
SET       0.399       95.938
SET       0.407       96.250
SET       0.415       96.562
SET       0.423       96.875
SET       0.431       97.031
SET       0.431       97.188
SET       0.439       97.344
SET       0.439       97.500
SET       0.447       97.656
SET       0.455       97.812
SET       0.463       97.969
SET       0.471       98.125
SET       0.479       98.281
SET       0.495       98.438
SET       0.503       98.516
SET       0.503       98.594
SET       0.511       98.672
SET       0.511       98.750
SET       0.519       98.828
SET       0.527       98.906
SET       0.535       98.984
SET       0.543       99.062
SET       0.551       99.141
SET       0.559       99.219
SET       0.567       99.258
SET       0.567       99.297
SET       0.575       99.336
SET       0.583       99.375
SET       0.583       99.414
SET       0.599       99.453
SET       0.599       99.492
SET       0.615       99.531
SET       0.631       99.570
SET       0.639       99.609
SET       0.639       99.629
SET       0.655       99.648
SET       0.655       99.668
SET       0.663       99.688
SET       0.663       99.707
SET       0.679       99.727
SET       0.687       99.746
SET       0.695       99.766
SET       0.711       99.785
SET       0.727       99.805
SET       0.743       99.814
SET       0.751       99.824
SET       0.751       99.834
SET       0.767       99.844
SET       0.775       99.854
SET       0.791       99.863
SET       0.823       99.873
SET       0.855       99.883
SET       0.935       99.893
SET       1.111       99.902
SET       1.135       99.907
SET       1.151       99.912
SET       1.175       99.917
SET       1.199       99.922
SET       1.231       99.927
SET       1.239       99.932
SET       1.247       99.937
SET       1.263       99.941
SET       1.263       99.946
SET       1.279       99.951
SET       1.279       99.954
SET       1.279       99.956
SET       1.279       99.958
SET       1.295       99.961
SET       1.295       99.963
SET       1.303       99.966
SET       1.303       99.968
SET       1.311       99.971
SET       1.311       99.973
SET       1.327       99.976
SET       1.327       99.977
SET       1.327       99.978
SET       1.327       99.979
SET       1.351       99.980
SET       1.351       99.982
SET       1.351       99.983
warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
SET       1.351       99.984
SET       1.351       99.985
SET       1.351       99.987
SET       1.351       99.988
SET       1.351       99.988
SET       1.351       99.989
SET       1.351       99.990
SET       1.367       99.990
SET       1.367       99.991
SET       1.367       99.991
SET       1.367       99.992
SET       1.367       99.993
SET       1.367       99.993
SET       1.367       99.994
SET       1.367       99.994
SET       1.367       99.995
SET       1.367       99.995
SET       1.399       99.995
SET       1.399      100.000
---
GET       0.031        0.000
GET       0.143        5.000
GET       0.167       10.000
GET       0.183       15.000
GET       0.191       20.000
GET       0.199       25.000
GET       0.207       30.000
GET       0.215       35.000
GET       0.223       40.000
GET       0.231       45.000
GET       0.239       50.000
GET       0.239       52.500
GET       0.247       55.000
GET       0.247       57.500
GET       0.255       60.000
GET       0.263       62.500
GET       0.263       65.000
GET       0.271       67.500
GET       0.271       70.000
GET       0.279       72.500
GET       0.279       75.000
GET       0.287       76.250
GET       0.287       77.500
GET       0.287       78.750
GET       0.295       80.000
GET       0.295       81.250
GET       0.295       82.500
GET       0.303       83.750
GET       0.303       85.000
GET       0.311       86.250
GET       0.311       87.500
GET       0.319       88.125
GET       0.319       88.750
GET       0.319       89.375
GET       0.327       90.000
GET       0.327       90.625
GET       0.335       91.250
GET       0.335       91.875
GET       0.343       92.500
GET       0.351       93.125
GET       0.359       93.750
GET       0.359       94.062
GET       0.367       94.375
GET       0.375       94.688
GET       0.375       95.000
GET       0.383       95.312
GET       0.391       95.625
GET       0.399       95.938
GET       0.407       96.250
GET       0.415       96.562
GET       0.423       96.875
GET       0.431       97.031
GET       0.431       97.188
GET       0.439       97.344
GET       0.439       97.500
GET       0.447       97.656
GET       0.455       97.812
GET       0.463       97.969
GET       0.471       98.125
GET       0.479       98.281
GET       0.495       98.438
GET       0.503       98.516
GET       0.503       98.594
GET       0.511       98.672
GET       0.511       98.750
GET       0.519       98.828
GET       0.527       98.906
GET       0.535       98.984
GET       0.543       99.062
GET       0.551       99.141
GET       0.559       99.219
GET       0.567       99.258
GET       0.567       99.297
GET       0.575       99.336
GET       0.583       99.375
GET       0.583       99.414
GET       0.599       99.453
GET       0.599       99.492
GET       0.615       99.531
GET       0.631       99.570
GET       0.639       99.609
GET       0.639       99.629
GET       0.655       99.648
GET       0.655       99.668
GET       0.663       99.688
GET       0.663       99.707
GET       0.679       99.727
GET       0.687       99.746
GET       0.695       99.766
GET       0.711       99.785
GET       0.727       99.805
GET       0.743       99.814
GET       0.751       99.824
GET       0.751       99.834
GET       0.767       99.844
GET       0.775       99.854
GET       0.791       99.863
GET       0.823       99.873
GET       0.855       99.883
GET       0.935       99.893
GET       1.111       99.902
GET       1.135       99.907
GET       1.151       99.912
GET       1.175       99.917
GET       1.199       99.922
GET       1.231       99.927
GET       1.239       99.932
GET       1.247       99.937
GET       1.263       99.941
GET       1.263       99.946
GET       1.279       99.951
GET       1.279       99.954
GET       1.279       99.956
GET       1.279       99.958
GET       1.295       99.961
GET       1.295       99.963
GET       1.303       99.966
GET       1.303       99.968
GET       1.311       99.971
GET       1.311       99.973
GET       1.327       99.976
GET       1.327       99.977
GET       1.327       99.978
GET       1.327       99.979
GET       1.351       99.980
GET       1.351       99.982
GET       1.351       99.983
GET       1.351       99.984
GET       1.351       99.985
GET       1.351       99.987
GET       1.351       99.988
GET       1.351       99.988
GET       1.351       99.989
GET       1.351       99.990
GET       1.367       99.990
GET       1.367       99.991
GET       1.367       99.991
GET       1.367       99.992
GET       1.367       99.993
GET       1.367       99.993
GET       1.367       99.994
GET       1.367       99.994
GET       1.367       99.995
GET       1.367       99.995
GET       1.399       99.995
GET       1.399      100.000
---
WAIT      0.000      100.000



--------------------------------------------------------
Pipeline Depth: 50
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   0 secs]  0 threads 10 conns:      200000 ops,       0 (avg: 1401482) ops/sec, 0.00KB/sec (avg: 
100.37MB/sec),  0.00 (avg:  0.70) msec latency

warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets      1264808.80          ---          ---         0.70516         0.67100         1.48700         2.14300     97570.47 
Gets       140534.31         0.00    140534.31         0.70516         0.67100         1.48700         2.14300      5488.52 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1405343.11         0.00    140534.31         0.70516         0.67100         1.48700         2.14300    103059.00 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.143        0.000
SET       0.383        5.000
SET       0.447       10.000
SET       0.487       15.000
SET       0.527       20.000
SET       0.559       25.000
SET       0.583       30.000
SET       0.607       35.000
SET       0.631       40.000
SET       0.655       45.000
SET       0.671       50.000
SET       0.687       52.500
SET       0.695       55.000
SET       0.711       57.500
SET       0.727       60.000
SET       0.743       62.500
SET       0.759       65.000
SET       0.767       67.500
SET       0.783       70.000
SET       0.799       72.500
SET       0.823       75.000
SET       0.831       76.250
SET       0.839       77.500
SET       0.855       78.750
SET       0.863       80.000
SET       0.871       81.250
SET       0.887       82.500
SET       0.903       83.750
SET       0.911       85.000
SET       0.935       86.250
SET       0.951       87.500
SET       0.959       88.125
SET       0.967       88.750
SET       0.983       89.375
SET       0.999       90.000
SET       1.007       90.625
SET       1.023       91.250
SET       1.039       91.875
SET       1.055       92.500
SET       1.079       93.125
SET       1.103       93.750
SET       1.111       94.062
SET       1.119       94.375
SET       1.135       94.688
SET       1.151       95.000
SET       1.167       95.312
SET       1.175       95.625
SET       1.183       95.938
SET       1.199       96.250
SET       1.223       96.562
SET       1.239       96.875
SET       1.247       97.031
SET       1.263       97.188
SET       1.279       97.344
SET       1.287       97.500
SET       1.295       97.656
SET       1.311       97.812
SET       1.327       97.969
SET       1.343       98.125
SET       1.367       98.281
SET       1.375       98.438
SET       1.391       98.516
SET       1.399       98.594
SET       1.407       98.672
SET       1.423       98.750
SET       1.439       98.828
SET       1.447       98.906
SET       1.487       98.984
SET       1.503       99.062
SET       1.527       99.141
SET       1.543       99.219
SET       1.551       99.258
SET       1.559       99.297
SET       1.567       99.336
SET       1.583       99.375
SET       1.607       99.414
SET       1.647       99.453
SET       1.647       99.492
SET       1.671       99.531
SET       1.679       99.570
SET       1.687       99.609
SET       1.695       99.629
SET       1.695       99.648
SET       1.711       99.668
SET       1.759       99.688
SET       1.767       99.707
SET       1.815       99.727
SET       1.815       99.746
SET       1.847       99.766
SET       1.863       99.785
SET       1.887       99.805
SET       1.887       99.814
SET       1.887       99.824
SET       1.975       99.834
SET       1.975       99.844
SET       2.031       99.854
SET       2.031       99.863
SET       2.031       99.873
SET       2.143       99.883
SET       2.143       99.893
SET       2.271       99.902
SET       2.271       99.907
SET       2.271       99.912
SET       2.271       99.917
SET       2.271       99.922
SET       2.335       99.927
SET       2.335       99.932
SET       2.335       99.937
SET       2.335       99.941
SET       2.335       99.946
SET       2.399       99.951
SET       2.399       99.954
SET       2.399       99.956
SET       2.399       99.958
SET       2.399       99.961
SET       2.399       99.963
SET       2.399       99.966
SET       2.399       99.968
SET       2.399       99.971
SET       2.399       99.973
SET       2.463       99.976
SET       2.463      100.000
---
GET       0.143        0.000
GET       0.383        5.000
GET       0.447       10.000
GET       0.487       15.000
GET       0.527       20.000
GET       0.559       25.000
GET       0.583       30.000
GET       0.607       35.000
GET       0.631       40.000
GET       0.655       45.000
GET       0.671       50.000
GET       0.687       52.500
GET       0.695       55.000
GET       0.711       57.500
GET       0.727       60.000
GET       0.743       62.500
GET       0.759       65.000
GET       0.767       67.500
GET       0.783       70.000
GET       0.799       72.500
GET       0.823       75.000
GET       0.831       76.250
GET       0.839       77.500
GET       0.855       78.750
GET       0.863       80.000
GET       0.871       81.250
GET       0.887       82.500
GET       0.903       83.750
GET       0.911       85.000
GET       0.935       86.250
GET       0.951       87.500
GET       0.959       88.125
GET       0.967       88.750
GET       0.983       89.375
GET       0.999       90.000
GET       1.007       90.625
GET       1.023       91.250
GET       1.039       91.875
GET       1.055       92.500
GET       1.079       93.125
GET       1.103       93.750
GET       1.111       94.062
GET       1.119       94.375
GET       1.135       94.688
GET       1.151       95.000
GET       1.167       95.312
GET       1.175       95.625
GET       1.183       95.938
GET       1.199       96.250
GET       1.223       96.562
GET       1.239       96.875
GET       1.247       97.031
GET       1.263       97.188
GET       1.279       97.344
GET       1.287       97.500
GET       1.295       97.656
GET       1.311       97.812
GET       1.327       97.969
GET       1.343       98.125
GET       1.367       98.281
GET       1.375       98.438
GET       1.391       98.516
GET       1.399       98.594
GET       1.407       98.672
GET       1.423       98.750
GET       1.439       98.828
GET       1.447       98.906
GET       1.487       98.984
GET       1.503       99.062
GET       1.527       99.141
GET       1.543       99.219
GET       1.551       99.258
GET       1.559       99.297
GET       1.567       99.336
GET       1.583       99.375
GET       1.607       99.414
GET       1.647       99.453
GET       1.647       99.492
GET       1.671       99.531
GET       1.679       99.570
GET       1.687       99.609
GET       1.695       99.629
GET       1.695       99.648
GET       1.711       99.668
GET       1.759       99.688
GET       1.767       99.707
GET       1.815       99.727
GET       1.815       99.746
GET       1.847       99.766
GET       1.863       99.785
GET       1.887       99.805
GET       1.887       99.814
GET       1.887       99.824
GET       1.975       99.834
GET       1.975       99.844
GET       2.031       99.854
GET       2.031       99.863
GET       2.031       99.873
GET       2.143       99.883
GET       2.143       99.893
GET       2.271       99.902
GET       2.271       99.907
GET       2.271       99.912
GET       2.271       99.917
GET       2.271       99.922
GET       2.335       99.927
GET       2.335       99.932
GET       2.335       99.937
GET       2.335       99.941
GET       2.335       99.946
GET       2.399       99.951
GET       2.399       99.954
GET       2.399       99.956
GET       2.399       99.958
GET       2.399       99.961
GET       2.399       99.963
GET       2.399       99.966
GET       2.399       99.968
GET       2.399       99.971
GET       2.399       99.973
GET       2.463       99.976
GET       2.463      100.000
---
WAIT      0.000      100.000